BlazeDemo-Taurus.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: RECORD 04-22-21 12.15.42 PM-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 2m

- executor: jmeter
  scenario: RECORD 04-22-21 12.15.42 PM-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 1m

scenarios:
  RECORD 04-22-21 12.15.42 PM-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1920,884)
      - openWindow()
      - switchWindow(win_ser_1)
      - clickByCSS(input.btn.btn-primary)
      - clickByXPath((//input[@value='Choose This Flight'])[2])
      - clickByCSS(input.btn.btn-primary)

  RECORD 04-22-21 12.15.42 PM-Http:
    headers:
      sec-ch-ua: '"Google Chrome";v="89", "Chromium";v="89", ";Not A Brand";v="99"'
      sec-ch-ua-mobile: '?0'
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/89.0.4389.90 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://blazedemo.com/'
            method: GET
            label: 'https://blazedemo.com/'
            think-time: 0ms
            headers: {}
          - url: 'https://blazedemo.com/reserve.php'
            method: POST
            label: 'https://blazedemo.com/reserve.php'
            think-time: 6305ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              fromPort: Paris
              toPort: Buenos Aires
          - url: 'https://blazedemo.com/purchase.php'
            method: POST
            label: 'https://blazedemo.com/purchase.php'
            think-time: 5038ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              airline: United Airlines
              flight: '234'
              fromPort: Paris
              price: '432.98'
              toPort: Buenos Aires
          - url: 'https://blazedemo.com/confirmation.php'
            method: POST
            label: 'https://blazedemo.com/confirmation.php'
            think-time: 7493ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              _token: ''
              address: ''
              cardType: visa
              city: ''
              creditCardMonth: '11'
              creditCardNumber: ''
              creditCardYear: '2017'
              inputName: ''
              nameOnCard: ''
              state: ''
              zipCode: ''